# تابعی بنویس که قیمت و تعداد محصول را بگیرد و قیمت کل را برگرداند.
# def sum_products(count , price):

# 12. مجموع تمام اعداد داخل یک لیست را حساب کن.
b=[42, 7, 91, 15, 63, 28, 4, 76, 33, 58, 12, 99, 21, 67, 38, 5, 84, 49, 73, 30]


# 13.لیست زیر درصد تخفیف کالاهاست
# [10,80,0,12,8,0,0,0,12]
# ان هایی که تخفیف دارند مقدار استرینگ "تخقیق دار" به لیست جدید اضافه بشه
# و آن هایی که صفر هستن "بدون تخقیق " در لیست جدید اضافه بشه
# مانند خروجی زیر
# ["تخفیف دار","بدون تخفیف",.....]

total= 0
for a in b:
    total=total + a

print(total)